files/htrap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-04 Mo 14:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to read a paper in microeconomics</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christoph Schottmüller" />
<link rel="stylesheet" href="./css/stylesheet.css">
</head>
<body>
<div id="preamble" class="status">
<div id="preamble" class="status">
  <div class="banner">
 

    <p style="text-align: justify;margin-bottom: -0.6cm;margin-top: -0.4cm;" >      

  <a id="subtitle" href="https://schottmueller.github.io/index.html">Home</a>
  <a id="subtitle" href="https://schottmueller.github.io/research.html">Research</a>
  <a id="subtitle" href="https://schottmueller.github.io/teaching.html">Teaching</a>
  <a id="subtitle" href="https://schottmueller.github.io/misc.html">Misc</a>

   <span> </span>
  
    </p>

    </div>
  </div>
  
<hr style="clear:both;margin-bottom: 0.4cm;"/>
</div>
<div id="content">
<h1 class="title">How to read a paper in microeconomics</h1>
<p>
This document suggests a way of reading a theoretical paper in microeconomics. It should be stressed that many of the steps below are non-sensical for papers in other sub-branches of economic research. Depending on the paper, some steps may not apply and other steps may be useful instead even for papers within microeconomics. That is, one should view the questions below only as a rough guide and keep in mind that there is no single approach that fits all possible papers.
</p>
<div id="outline-container-orgd078c76" class="outline-2">
<h2 id="orgd078c76">Guide</h2>
<div class="outline-text-2" id="text-orgd078c76">
</div>
<ul class="org-ul">
<li><a id="orga628c61"></a>What is the paper roughly about?<br />
<ul class="org-ul">
<li><a id="org3ce17cf"></a>Title<br /></li>
<li><a id="org9fca696"></a>Abstract<br /></li>
<li><a id="org0dfd1a4"></a>For experts: authors, references, "thank you footnote"\hspace*{5cm}\linebreak<br />
<div class="outline-text-4" id="text-org0dfd1a4">
<p>
This makes only sense if one knows who is working on what and/or if one knows some papers on the reference list.
</p>
</div>
</li>
</ul>
</li>

<li><a id="org07c3f3b"></a>Quick skim<br />
<ul class="org-ul">
<li><a id="orgd74336e"></a>What is the structure of the paper?<br /></li>
<li><a id="orged8f2fa"></a>What methods are used? (only theory? is there also empirics, an experiment or simulations?)<br /></li>
<li><a id="orgf40e80a"></a>Are there interesting graphs?<br /></li>
</ul>
</li>

<li><a id="orge21fa51"></a>First evaluation<br />
<ul class="org-ul">
<li><a id="orgadc608b"></a>What can you expect to learn from this paper?<br /></li>
<li><a id="org7305235"></a>Does it connect to other things you know/read?<br /></li>
<li><a id="orgdd27bfc"></a><i>if part of independent literature search:</i> Is this the right paper for my purposes?<br /></li>
</ul>
</li>

<li><a id="orgfd07209"></a>What are the research questions?<br />
<ul class="org-ul">
<li><a id="org06fb79c"></a>Skim through introduction and conclusion (possibly re-read abstract)<br /></li>
<li><a id="orgbcb4c23"></a>How is the paper motivated? (other literature, real world phenomena, stylized facts)<br /></li>
<li><a id="org7d1e298"></a>Check the literature section: how is the paper different from the prior literature? do the authors disagree with some prior work or do they extend it?<br /></li>
<li><a id="org3316a99"></a>What could be applications?<br /></li>
<li><a id="org36ea426"></a>State the main research question(s). Are there subquestions?<br /></li>
</ul>
</li>

<li><a id="orgde985c8"></a>What are the results?<br />
<ul class="org-ul">
<li><a id="orgfafb50d"></a>Read respective parts of conclusion and introduction<br /></li>
<li><a id="org2804e8a"></a>Look for typographically highlighted major results (theorems, propositions)\linebreak<br />
<div class="outline-text-4" id="text-org2804e8a">
<p>
The paragraph above or below such a result will often contain a "human readable" explanantion of what this result means.
</p>
</div>
</li>
<li><a id="orga7fad45"></a>Check graphs and tables<br /></li>
</ul>
</li>

<li><a id="org9ab2c5e"></a>Are there policy implications or applications?<br />
<ul class="org-ul">
<li><a id="org7098cc5"></a>Read respective parts of introduction and conclusion and possibly result section<br /></li>
<li><a id="orgd92f01b"></a>Skim discussion section (if there is any)<br /></li>
<li><a id="org5239c88"></a>Try yourself to come up with applications and implications!<br /></li>
</ul>
</li>

<li><a id="org371a23a"></a>Interim evaluation<br />
<ul class="org-ul">
<li><a id="orgf510ff4"></a><i>if part of independent literature search:</i>  Should you get deeper into this paper?<br /></li>
</ul>
</li>

<li><a id="org9e4b659"></a>How did they get to the results?<br />
<ul class="org-ul">
<li><a id="org8418606"></a>What kind of model is used?<br />
<ul class="org-ul">
<li><a id="orgda06468"></a>who are the players?<br /></li>
<li><a id="orgbf48f9d"></a>what are their actions?<br /></li>
<li><a id="org6b6fe19"></a>who has what information?<br /></li>
<li><a id="org807b692"></a>what is the timing?<br /></li>
<li><a id="orgd776235"></a>what are the main assumptions?<br /></li>
<li><a id="orgcb4a4d9"></a>how does the model relate to models you know?<br /></li>
</ul>
</li>

<li><a id="orgf50abb3"></a>Read the major results (theorems, propositions) and the verbal explanations of these results and skim the minor results (lemmas).<br /></li>

<li><a id="org7cc36ec"></a>Find the parts where the authors explain the mechanism/reasoning/logic behind their main results and read it carefully.\hspace*{11cm}\linebreak<br />
<div class="outline-text-4" id="text-org7cc36ec">
<p>
This can be in the introduction or in the analysis/results section. If you cannot find it in the introduction check the text around the main result(s) or at the end of the analysis/results section. (If it is hard to understand the reasoning, you may at this point decide to read the main analysis/results section from start to end.) 
</p>
</div>
</li>

<li><a id="orgdff8596"></a>For experts: How do the assumptions drive the results?\linebreak<br />
<div class="outline-text-4" id="text-orgdff8596">
<p>
Can you see why a certain assumption is necessary to obtain a certain result/mechanism/logic?
</p>
</div>
</li>
</ul>
</li>

<li><a id="org41074b5"></a>For experts: Proofs  and derivations<br />
<ul class="org-ul">
<li><a id="org21dbca6"></a>Do the authors use a (proof) technique you want to learn?<br /></li>
<li><a id="org51f1267"></a>Is the mechanism/reasoning/logic unclear?<br /></li>
</ul>
</li>

<li><a id="orgd06d7e9"></a>Final evaluation<br />
<ul class="org-ul">
<li><a id="org743cd04"></a>Are the research questions answered? how?<br /></li>
<li><a id="org6408a5f"></a>For which applications are the assumptions (not) reasonable? (sometimes authors address this in a "discussion" section)<br /></li>
<li><a id="org9387c0f"></a>For which applications is the mechanism/reasoning/logic (not) convincing? (sometimes authors address this in a "discussion" section)<br /></li>
<li><a id="org276e75f"></a>Do you agree with the policy implications?<br /></li>
<li><a id="orgd9e3ec3"></a>How does the paper connect with other models/papers/arguments you know?<br /></li>
<li><a id="orgd4abdd6"></a>Is there something the authors could/should have done differently? What is a logical next step in the literature, i.e. how could a paper building upon this paper look like?<br /></li>
</ul>
</li>

<li><a id="org7a0d6a6"></a>For experts: Follow up<br />
<ul class="org-ul">
<li><a id="orgc9e4ff5"></a>Did the paper reference other work that you should read?<br /></li>
<li><a id="org6b621df"></a>Did you identify some gap in the literature that is worthwhile filling?<br /></li>
</ul>
</li>
</ul>
</div>


<div id="outline-container-org92b1c47" class="outline-2">
<h2 id="org92b1c47">Further hints and additional exercises</h2>
<div class="outline-text-2" id="text-org92b1c47">
</div>
<ul class="org-ul">
<li><a id="orge1418c3"></a><b>Introduction:</b><br />
<div class="outline-text-3" id="text-orge1418c3">
<p>
A major difference between academic work and other writing is the introduction. In academic work the introduction is <i>not</i> meant to merely introduce the topic and definitely not meant to create suspense. Instead the introduction contains more or less everything. Yes, the topic is motivated there and the research questions should be stated but it continues from there: usually the methods used to analyze the problem as well as the results are summarized. Towards the end of the intorduction there is usually a comparison with the existing literature to clarify what the contribution of this specific paper is. In this sense, the intorduction also has the role of an <i>executive summary</i>. The purpose of the introduction is not to make the reader read the rest of the paper but to inform him to such an extent about the paper that he (i) can make an informed decision about which parts of the paper (if any) he should read and (ii) knows the main message of the paper even if he does not read any further.
</p>

<p>
<b>Exercise:</b> Go through the introduction paragraph by paragraph and write down a subheading for each paragraph. (What does this paragraph achieve? Why is it there?) Is there some structure in the introduction? After doing this for several papers, you may want to compare these structures.
</p>
</div>
</li>

<li><a id="org5888290"></a><b>Summaries:</b><br />
<div class="outline-text-3" id="text-org5888290">
<p>
It can be useful to summarize the paper after reading it. The main reason is that you may need the paper again later on (e.g. you have to reference it as part of your Master thesis). Your summary should be such that in this case you do not have to look at the paper again but can simply read your summary to refresh your mind. Note that there is no "ideal summary". What should (not) be part of it depends very much on what you want to do with this summary and what background knowledge you expect yourself to have when reading it again later.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> 
My own paper summaries tend to be one page long.
</p>

<p>
<b>Exercise:</b> Write a one page summary of the paper. 
</p>
</div>
</li>
</ul>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">Of course, summarizing a paper can be a useful exercise in itself as you may realize that you did not understand some aspects of the paper entirely while writing the summary.</div></div>


</div>
</div></div>
<div id="postamble" class="status">

<hr style="clear:both;margin-top: -0.4cm;"/>

<div style="text-align: right;margin-top:-0.1cm">
  <a href="https://schottmueller.github.io/disclaimer.html"> <small>Disclaimer</small> </a>
</div>
</div>
</body>
</html>
